
#include <iostream>
#include <clocale>
#include <cmath>
using namespace std; // Подключение необходимых библиотек и пространства имен

long long factorial(int a) // Функция для вычисления факториала числа a с типом long long, чтобы избежать переполнения при больших значениях a 
{
    long long s = 1;
    for (int i = 1; i <= a; i++)
    {
        s *= i; // Находим факториал числа a, умножая s на i в цикле от 1 до a
    }
    return s; // Возвращаем результат вычисления факториала
}

int main()
{
    setlocale(LC_ALL, ".UTF8");

    double eps = 0.0001; // Заданная точность вычислений
    double a, sum = 0; // Текущий член ряда и его сумма
    int n = 1; // Номер текущего члена ряда

    a = (double)factorial(n) / factorial(2 * n); // Вычисляем первый член ряда

    while (fabs(a) >= eps) // Повторяем, пока член ряда не станет меньше точности
    {
        sum += a; // Добавляем текущий член к сумме
        n++; // Переходим к следующему члену
        a = (double)factorial(n) / factorial(2 * n); // Вычисляем следующий член ряда
    }

    cout << "Сумма ряда равна " << sum << endl; /* Выводим результат 
        "Сумма ряда равна 0.592262" */

    return 0;
}
